pablo0722/TD_II/workspace/THD_Meter_RTOS/Debug/cr_startup_lpc175x_6x.s
	.syntax unified
	.cpu cortex-m3
	.fpu softvfp
	.eabi_attribute 20, 1
	.eabi_attribute 21, 1
	.eabi_attribute 23, 3
	.eabi_attribute 24, 1
	.eabi_attribute 25, 1
	.eabi_attribute 26, 1
	.eabi_attribute 30, 4
	.eabi_attribute 34, 1
	.eabi_attribute 18, 4
	.thumb
	.syntax unified
	.file	"cr_startup_lpc175x_6x.c"
	.text
.Ltext0:
	.cfi_sections	.debug_frame
	.section	.after_vectors,"ax",%progbits
	.align	1
	.weak	NMI_Handler
	.thumb
	.thumb_func
	.type	NMI_Handler, %function
NMI_Handler:
.LFB3:
	.file 1 "../src/cr_startup_lpc175x_6x.c"
	.loc 1 326 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L2:
	b	.L2
	.cfi_endproc
.LFE3:
	.size	NMI_Handler, .-NMI_Handler
	.align	1
	.weak	HardFault_Handler
	.thumb
	.thumb_func
	.type	HardFault_Handler, %function
HardFault_Handler:
.LFB4:
	.loc 1 331 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L4:
	b	.L4
	.cfi_endproc
.LFE4:
	.size	HardFault_Handler, .-HardFault_Handler
	.align	1
	.weak	MemManage_Handler
	.thumb
	.thumb_func
	.type	MemManage_Handler, %function
MemManage_Handler:
.LFB5:
	.loc 1 336 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L6:
	b	.L6
	.cfi_endproc
.LFE5:
	.size	MemManage_Handler, .-MemManage_Handler
	.align	1
	.weak	BusFault_Handler
	.thumb
	.thumb_func
	.type	BusFault_Handler, %function
BusFault_Handler:
.LFB6:
	.loc 1 341 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L8:
	b	.L8
	.cfi_endproc
.LFE6:
	.size	BusFault_Handler, .-BusFault_Handler
	.align	1
	.weak	UsageFault_Handler
	.thumb
	.thumb_func
	.type	UsageFault_Handler, %function
UsageFault_Handler:
.LFB7:
	.loc 1 346 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L10:
	b	.L10
	.cfi_endproc
.LFE7:
	.size	UsageFault_Handler, .-UsageFault_Handler
	.align	1
	.weak	SVC_Handler
	.thumb
	.thumb_func
	.type	SVC_Handler, %function
SVC_Handler:
.LFB8:
	.loc 1 351 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L12:
	b	.L12
	.cfi_endproc
.LFE8:
	.size	SVC_Handler, .-SVC_Handler
	.align	1
	.weak	DebugMon_Handler
	.thumb
	.thumb_func
	.type	DebugMon_Handler, %function
DebugMon_Handler:
.LFB9:
	.loc 1 356 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L14:
	b	.L14
	.cfi_endproc
.LFE9:
	.size	DebugMon_Handler, .-DebugMon_Handler
	.align	1
	.weak	PendSV_Handler
	.thumb
	.thumb_func
	.type	PendSV_Handler, %function
PendSV_Handler:
.LFB10:
	.loc 1 361 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L16:
	b	.L16
	.cfi_endproc
.LFE10:
	.size	PendSV_Handler, .-PendSV_Handler
	.align	1
	.weak	SysTick_Handler
	.thumb
	.thumb_func
	.type	SysTick_Handler, %function
SysTick_Handler:
.LFB11:
	.loc 1 366 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L18:
	b	.L18
	.cfi_endproc
.LFE11:
	.size	SysTick_Handler, .-SysTick_Handler
	.align	1
	.weak	IntDefaultHandler
	.thumb
	.thumb_func
	.type	IntDefaultHandler, %function
IntDefaultHandler:
.LFB12:
	.loc 1 377 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
	@ link register save eliminated.
.L20:
	b	.L20
	.cfi_endproc
.LFE12:
	.size	IntDefaultHandler, .-IntDefaultHandler
	.weak	CANActivity_IRQHandler
	.thumb_set CANActivity_IRQHandler,IntDefaultHandler
	.weak	USBActivity_IRQHandler
	.thumb_set USBActivity_IRQHandler,IntDefaultHandler
	.weak	PLL1_IRQHandler
	.thumb_set PLL1_IRQHandler,IntDefaultHandler
	.weak	QEI_IRQHandler
	.thumb_set QEI_IRQHandler,IntDefaultHandler
	.weak	MCPWM_IRQHandler
	.thumb_set MCPWM_IRQHandler,IntDefaultHandler
	.weak	RIT_IRQHandler
	.thumb_set RIT_IRQHandler,IntDefaultHandler
	.weak	ETH_IRQHandler
	.thumb_set ETH_IRQHandler,IntDefaultHandler
	.weak	I2S_IRQHandler
	.thumb_set I2S_IRQHandler,IntDefaultHandler
	.weak	DMA_IRQHandler
	.thumb_set DMA_IRQHandler,IntDefaultHandler
	.weak	CAN_IRQHandler
	.thumb_set CAN_IRQHandler,IntDefaultHandler
	.weak	USB_IRQHandler
	.thumb_set USB_IRQHandler,IntDefaultHandler
	.weak	BOD_IRQHandler
	.thumb_set BOD_IRQHandler,IntDefaultHandler
	.weak	ADC_IRQHandler
	.thumb_set ADC_IRQHandler,IntDefaultHandler
	.weak	EINT3_IRQHandler
	.thumb_set EINT3_IRQHandler,IntDefaultHandler
	.weak	EINT2_IRQHandler
	.thumb_set EINT2_IRQHandler,IntDefaultHandler
	.weak	EINT1_IRQHandler
	.thumb_set EINT1_IRQHandler,IntDefaultHandler
	.weak	EINT0_IRQHandler
	.thumb_set EINT0_IRQHandler,IntDefaultHandler
	.weak	RTC_IRQHandler
	.thumb_set RTC_IRQHandler,IntDefaultHandler
	.weak	PLL0_IRQHandler
	.thumb_set PLL0_IRQHandler,IntDefaultHandler
	.weak	SSP1_IRQHandler
	.thumb_set SSP1_IRQHandler,IntDefaultHandler
	.weak	SSP0_IRQHandler
	.thumb_set SSP0_IRQHandler,IntDefaultHandler
	.weak	SPI_IRQHandler
	.thumb_set SPI_IRQHandler,IntDefaultHandler
	.weak	I2C2_IRQHandler
	.thumb_set I2C2_IRQHandler,IntDefaultHandler
	.weak	I2C1_IRQHandler
	.thumb_set I2C1_IRQHandler,IntDefaultHandler
	.weak	I2C0_IRQHandler
	.thumb_set I2C0_IRQHandler,IntDefaultHandler
	.weak	PWM1_IRQHandler
	.thumb_set PWM1_IRQHandler,IntDefaultHandler
	.weak	UART3_IRQHandler
	.thumb_set UART3_IRQHandler,IntDefaultHandler
	.weak	UART2_IRQHandler
	.thumb_set UART2_IRQHandler,IntDefaultHandler
	.weak	UART1_IRQHandler
	.thumb_set UART1_IRQHandler,IntDefaultHandler
	.weak	UART0_IRQHandler
	.thumb_set UART0_IRQHandler,IntDefaultHandler
	.weak	TIMER3_IRQHandler
	.thumb_set TIMER3_IRQHandler,IntDefaultHandler
	.weak	TIMER2_IRQHandler
	.thumb_set TIMER2_IRQHandler,IntDefaultHandler
	.weak	TIMER1_IRQHandler
	.thumb_set TIMER1_IRQHandler,IntDefaultHandler
	.weak	TIMER0_IRQHandler
	.thumb_set TIMER0_IRQHandler,IntDefaultHandler
	.weak	WDT_IRQHandler
	.thumb_set WDT_IRQHandler,IntDefaultHandler
	.align	1
	.global	data_init
	.thumb
	.thumb_func
	.type	data_init, %function
data_init:
.LFB0:
	.loc 1 233 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
.LVL0:
	.loc 1 237 0
	mov	r3, r1
	.loc 1 233 0
	push	{r4, lr}
	.cfi_def_cfa_offset 8
	.cfi_offset 4, -8
	.cfi_offset 14, -4
	.loc 1 238 0
	subs	r0, r0, r1
.LVL1:
.L22:
	.loc 1 237 0 discriminator 1
	subs	r4, r3, r1
.LVL2:
	cmp	r2, r4
	bls	.L25
.LVL3:
	.loc 1 238 0 discriminator 3
	ldr	r4, [r0, r3]
.LVL4:
	str	r4, [r3], #4
.LVL5:
	b	.L22
.LVL6:
.L25:
	.loc 1 239 0
	pop	{r4, pc}
	.cfi_endproc
.LFE0:
	.size	data_init, .-data_init
	.align	1
	.global	bss_init
	.thumb
	.thumb_func
	.type	bss_init, %function
bss_init:
.LFB1:
	.loc 1 242 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
.LVL7:
	.loc 1 243 0
	mov	r3, r0
.LVL8:
	.loc 1 242 0
	push	{r4, lr}
	.cfi_def_cfa_offset 8
	.cfi_offset 4, -8
	.cfi_offset 14, -4
	.loc 1 246 0
	movs	r4, #0
.LVL9:
.L27:
	.loc 1 245 0 discriminator 1
	subs	r2, r3, r0
.LVL10:
	cmp	r1, r2
	bls	.L29
	.loc 1 246 0 discriminator 3
	str	r4, [r3], #4
.LVL11:
	b	.L27
.LVL12:
.L29:
	.loc 1 247 0
	pop	{r4, pc}
	.cfi_endproc
.LFE1:
	.size	bss_init, .-bss_init
	.align	1
	.global	ResetISR
	.thumb
	.thumb_func
	.type	ResetISR, %function
ResetISR:
.LFB2:
	.loc 1 268 0
	.cfi_startproc
	@ args = 0, pretend = 0, frame = 0
	@ frame_needed = 0, uses_anonymous_args = 0
.LVL13:
	push	{r3, r4, r5, lr}
	.cfi_def_cfa_offset 16
	.cfi_offset 3, -16
	.cfi_offset 4, -12
	.cfi_offset 5, -8
	.cfi_offset 14, -4
	.loc 1 277 0
	ldr	r4, .L38
	.loc 1 280 0
	ldr	r5, .L38+4
.LVL14:
.L31:
	cmp	r4, r5
	bcs	.L36
.LVL15:
	.loc 1 282 0
	ldmia	r4, {r0, r1}
.LVL16:
	adds	r4, r4, #12
.LVL17:
	.loc 1 284 0
	ldr	r2, [r4, #-4]
	bl	data_init
.LVL18:
	b	.L31
.L36:
	.loc 1 288 0
	ldr	r5, .L38+8
.L33:
	cmp	r4, r5
	bcs	.L37
.LVL19:
	.loc 1 289 0
	ldr	r0, [r4], #8
.LVL20:
	.loc 1 291 0
	ldr	r1, [r4, #-4]
	bl	bss_init
.LVL21:
	b	.L33
.L37:
	.loc 1 295 0
	bl	SystemInit
.LVL22:
	.loc 1 309 0
	bl	main
.LVL23:
.L35:
	b	.L35
.L39:
	.align	2
.L38:
	.word	__data_section_table
	.word	__data_section_table_end
	.word	__bss_section_table_end
	.cfi_endproc
.LFE2:
	.size	ResetISR, .-ResetISR
	.global	g_pfnVectors
	.section	.isr_vector,"a",%progbits
	.align	2
	.type	g_pfnVectors, %object
	.size	g_pfnVectors, 204
g_pfnVectors:
	.word	_vStackTop
	.word	ResetISR
	.word	NMI_Handler
	.word	HardFault_Handler
	.word	MemManage_Handler
	.word	BusFault_Handler
	.word	UsageFault_Handler
	.word	__valid_user_code_checksum
	.word	0
	.word	0
	.word	0
	.word	SVC_Handler
	.word	DebugMon_Handler
	.word	0
	.word	PendSV_Handler
	.word	SysTick_Handler
	.word	WDT_IRQHandler
	.word	TIMER0_IRQHandler
	.word	TIMER1_IRQHandler
	.word	TIMER2_IRQHandler
	.word	TIMER3_IRQHandler
	.word	UART0_IRQHandler
	.word	UART1_IRQHandler
	.word	UART2_IRQHandler
	.word	UART3_IRQHandler
	.word	PWM1_IRQHandler
	.word	I2C0_IRQHandler
	.word	I2C1_IRQHandler
	.word	I2C2_IRQHandler
	.word	SPI_IRQHandler
	.word	SSP0_IRQHandler
	.word	SSP1_IRQHandler
	.word	PLL0_IRQHandler
	.word	RTC_IRQHandler
	.word	EINT0_IRQHandler
	.word	EINT1_IRQHandler
	.word	EINT2_IRQHandler
	.word	EINT3_IRQHandler
	.word	ADC_IRQHandler
	.word	BOD_IRQHandler
	.word	USB_IRQHandler
	.word	CAN_IRQHandler
	.word	DMA_IRQHandler
	.word	I2S_IRQHandler
	.word	ETH_IRQHandler
	.word	RIT_IRQHandler
	.word	MCPWM_IRQHandler
	.word	QEI_IRQHandler
	.word	PLL1_IRQHandler
	.word	USBActivity_IRQHandler
	.word	CANActivity_IRQHandler
	.weak	__valid_user_code_checksum
	.text
.Letext0:
	.section	.debug_info,"",%progbits
.Ldebug_info0:
	.4byte	0x28d
	.2byte	0x4
	.4byte	.Ldebug_abbrev0
	.byte	0x4
	.uleb128 0x1
	.4byte	.LASF397
	.byte	0xc
	.4byte	.LASF398
	.4byte	.LASF399
	.4byte	.Ldebug_ranges0+0
	.4byte	0
	.4byte	.Ldebug_line0
	.4byte	.Ldebug_macro0
	.uleb128 0x2
	.4byte	.LASF368
	.byte	0x1
	.2byte	0x145
	.4byte	.LFB3
	.4byte	.LFE3-.LFB3
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF369
	.byte	0x1
	.2byte	0x14a
	.4byte	.LFB4
	.4byte	.LFE4-.LFB4
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF370
	.byte	0x1
	.2byte	0x14f
	.4byte	.LFB5
	.4byte	.LFE5-.LFB5
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF371
	.byte	0x1
	.2byte	0x154
	.4byte	.LFB6
	.4byte	.LFE6-.LFB6
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF372
	.byte	0x1
	.2byte	0x159
	.4byte	.LFB7
	.4byte	.LFE7-.LFB7
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF373
	.byte	0x1
	.2byte	0x15e
	.4byte	.LFB8
	.4byte	.LFE8-.LFB8
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF374
	.byte	0x1
	.2byte	0x163
	.4byte	.LFB9
	.4byte	.LFE9-.LFB9
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF375
	.byte	0x1
	.2byte	0x168
	.4byte	.LFB10
	.4byte	.LFE10-.LFB10
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF376
	.byte	0x1
	.2byte	0x16d
	.4byte	.LFB11
	.4byte	.LFE11-.LFB11
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x2
	.4byte	.LASF377
	.byte	0x1
	.2byte	0x178
	.4byte	.LFB12
	.4byte	.LFE12-.LFB12
	.uleb128 0x1
	.byte	0x9c
	.uleb128 0x3
	.4byte	.LASF383
	.byte	0x1
	.byte	0xe9
	.4byte	.LFB0
	.4byte	.LFE0-.LFB0
	.uleb128 0x1
	.byte	0x9c
	.4byte	0x149
	.uleb128 0x4
	.4byte	.LASF378
	.byte	0x1
	.byte	0xe9
	.4byte	0x149
	.4byte	.LLST0
	.uleb128 0x5
	.4byte	.LASF379
	.byte	0x1
	.byte	0xe9
	.4byte	0x149
	.uleb128 0x1
	.byte	0x51
	.uleb128 0x6
	.ascii	"len\000"
	.byte	0x1
	.byte	0xe9
	.4byte	0x149
	.uleb128 0x1
	.byte	0x52
	.uleb128 0x7
	.4byte	.LASF380
	.byte	0x1
	.byte	0xea
	.4byte	0x150
	.4byte	.LLST1
	.uleb128 0x7
	.4byte	.LASF381
	.byte	0x1
	.byte	0xeb
	.4byte	0x150
	.4byte	.LLST2
	.uleb128 0x7
	.4byte	.LASF382
	.byte	0x1
	.byte	0xec
	.4byte	0x149
	.4byte	.LLST3
	.byte	0
	.uleb128 0x8
	.byte	0x4
	.byte	0x7
	.4byte	.LASF389
	.uleb128 0x9
	.byte	0x4
	.4byte	0x149
	.uleb128 0x3
	.4byte	.LASF384
	.byte	0x1
	.byte	0xf2
	.4byte	.LFB1
	.4byte	.LFE1-.LFB1
	.uleb128 0x1
	.byte	0x9c
	.4byte	0x1a4
	.uleb128 0x5
	.4byte	.LASF379
	.byte	0x1
	.byte	0xf2
	.4byte	0x149
	.uleb128 0x1
	.byte	0x50
	.uleb128 0x6
	.ascii	"len\000"
	.byte	0x1
	.byte	0xf2
	.4byte	0x149
	.uleb128 0x1
	.byte	0x51
	.uleb128 0x7
	.4byte	.LASF380
	.byte	0x1
	.byte	0xf3
	.4byte	0x150
	.4byte	.LLST4
	.uleb128 0x7
	.4byte	.LASF382
	.byte	0x1
	.byte	0xf4
	.4byte	0x149
	.4byte	.LLST5
	.byte	0
	.uleb128 0xa
	.4byte	.LASF400
	.byte	0x1
	.2byte	0x10c
	.4byte	.LFB2
	.4byte	.LFE2-.LFB2
	.uleb128 0x1
	.byte	0x9c
	.4byte	0x21d
	.uleb128 0xb
	.4byte	.LASF385
	.byte	0x1
	.2byte	0x111
	.4byte	0x149
	.uleb128 0x1
	.byte	0x50
	.uleb128 0xc
	.4byte	.LASF386
	.byte	0x1
	.2byte	0x111
	.4byte	0x149
	.4byte	.LLST6
	.uleb128 0xc
	.4byte	.LASF387
	.byte	0x1
	.2byte	0x111
	.4byte	0x149
	.4byte	.LLST7
	.uleb128 0xc
	.4byte	.LASF388
	.byte	0x1
	.2byte	0x112
	.4byte	0x150
	.4byte	.LLST8
	.uleb128 0xd
	.4byte	.LVL18
	.4byte	0xdd
	.uleb128 0xd
	.4byte	.LVL21
	.4byte	0x156
	.uleb128 0xd
	.4byte	.LVL22
	.4byte	0x27a
	.uleb128 0xd
	.4byte	.LVL23
	.4byte	0x285
	.byte	0
	.uleb128 0xe
	.4byte	0x23b
	.4byte	0x22d
	.uleb128 0xf
	.4byte	0x22d
	.byte	0x32
	.byte	0
	.uleb128 0x8
	.byte	0x4
	.byte	0x7
	.4byte	.LASF390
	.uleb128 0x9
	.byte	0x4
	.4byte	0x23a
	.uleb128 0x10
	.uleb128 0x11
	.4byte	0x234
	.uleb128 0x12
	.4byte	.LASF391
	.byte	0x1
	.byte	0xa5
	.4byte	0x251
	.uleb128 0x5
	.byte	0x3
	.4byte	g_pfnVectors
	.uleb128 0x11
	.4byte	0x21d
	.uleb128 0x13
	.4byte	.LASF392
	.byte	0x1
	.2byte	0x100
	.4byte	0x149
	.uleb128 0x13
	.4byte	.LASF393
	.byte	0x1
	.2byte	0x101
	.4byte	0x149
	.uleb128 0x13
	.4byte	.LASF394
	.byte	0x1
	.2byte	0x103
	.4byte	0x149
	.uleb128 0x14
	.4byte	.LASF395
	.4byte	.LASF395
	.byte	0x1
	.byte	0x3a
	.uleb128 0x14
	.4byte	.LASF396
	.4byte	.LASF396
	.byte	0x1
	.byte	0x8a
	.byte	0
	.section	.debug_abbrev,"",%progbits
.Ldebug_abbrev0:
	.uleb128 0x1
	.uleb128 0x11
	.byte	0x1
	.uleb128 0x25
	.uleb128 0xe
	.uleb128 0x13
	.uleb128 0xb
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x1b
	.uleb128 0xe
	.uleb128 0x55
	.uleb128 0x17
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x10
	.uleb128 0x17
	.uleb128 0x2119
	.uleb128 0x17
	.byte	0
	.byte	0
	.uleb128 0x2
	.uleb128 0x2e
	.byte	0
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2117
	.uleb128 0x19
	.byte	0
	.byte	0
	.uleb128 0x3
	.uleb128 0x2e
	.byte	0x1
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2117
	.uleb128 0x19
	.uleb128 0x1
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0x4
	.uleb128 0x5
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x17
	.byte	0
	.byte	0
	.uleb128 0x5
	.uleb128 0x5
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0x6
	.uleb128 0x5
	.byte	0
	.uleb128 0x3
	.uleb128 0x8
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0x7
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x17
	.byte	0
	.byte	0
	.uleb128 0x8
	.uleb128 0x24
	.byte	0
	.uleb128 0xb
	.uleb128 0xb
	.uleb128 0x3e
	.uleb128 0xb
	.uleb128 0x3
	.uleb128 0xe
	.byte	0
	.byte	0
	.uleb128 0x9
	.uleb128 0xf
	.byte	0
	.uleb128 0xb
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0xa
	.uleb128 0x2e
	.byte	0x1
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x27
	.uleb128 0x19
	.uleb128 0x87
	.uleb128 0x19
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x12
	.uleb128 0x6
	.uleb128 0x40
	.uleb128 0x18
	.uleb128 0x2117
	.uleb128 0x19
	.uleb128 0x1
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0xb
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0xc
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2
	.uleb128 0x17
	.byte	0
	.byte	0
	.uleb128 0xd
	.uleb128 0x4109
	.byte	0
	.uleb128 0x11
	.uleb128 0x1
	.uleb128 0x31
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0xe
	.uleb128 0x1
	.byte	0x1
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x1
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0xf
	.uleb128 0x21
	.byte	0
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x2f
	.uleb128 0xb
	.byte	0
	.byte	0
	.uleb128 0x10
	.uleb128 0x15
	.byte	0
	.uleb128 0x27
	.uleb128 0x19
	.byte	0
	.byte	0
	.uleb128 0x11
	.uleb128 0x26
	.byte	0
	.uleb128 0x49
	.uleb128 0x13
	.byte	0
	.byte	0
	.uleb128 0x12
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x2
	.uleb128 0x18
	.byte	0
	.byte	0
	.uleb128 0x13
	.uleb128 0x34
	.byte	0
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0x5
	.uleb128 0x49
	.uleb128 0x13
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3c
	.uleb128 0x19
	.byte	0
	.byte	0
	.uleb128 0x14
	.uleb128 0x2e
	.byte	0
	.uleb128 0x3f
	.uleb128 0x19
	.uleb128 0x3c
	.uleb128 0x19
	.uleb128 0x6e
	.uleb128 0xe
	.uleb128 0x3
	.uleb128 0xe
	.uleb128 0x3a
	.uleb128 0xb
	.uleb128 0x3b
	.uleb128 0xb
	.byte	0
	.byte	0
	.byte	0
	.section	.debug_loc,"",%progbits
.Ldebug_loc0:
.LLST0:
	.4byte	.LVL0
	.4byte	.LVL1
	.2byte	0x1
	.byte	0x50
	.4byte	.LVL1
	.4byte	.LFE0
	.2byte	0x4
	.byte	0xf3
	.uleb128 0x1
	.byte	0x50
	.byte	0x9f
	.4byte	0
	.4byte	0
.LLST1:
	.4byte	.LVL0
	.4byte	.LVL1
	.2byte	0x1
	.byte	0x51
	.4byte	.LVL1
	.4byte	.LVL3
	.2byte	0x1
	.byte	0x53
	.4byte	.LVL3
	.4byte	.LVL5
	.2byte	0x3
	.byte	0x73
	.sleb128 4
	.byte	0x9f
	.4byte	.LVL5
	.4byte	.LFE0
	.2byte	0x1
	.byte	0x53
	.4byte	0
	.4byte	0
.LLST2:
	.4byte	.LVL0
	.4byte	.LVL1
	.2byte	0x1
	.byte	0x50
	.4byte	0
	.4byte	0
.LLST3:
	.4byte	.LVL0
	.4byte	.LVL1
	.2byte	0x2
	.byte	0x30
	.byte	0x9f
	.4byte	.LVL1
	.4byte	.LVL2
	.2byte	0x6
	.byte	0x73
	.sleb128 0
	.byte	0x71
	.sleb128 0
	.byte	0x1c
	.byte	0x9f
	.4byte	.LVL2
	.4byte	.LVL4
	.2byte	0x1
	.byte	0x54
	.4byte	.LVL4
	.4byte	.LVL5
	.2byte	0x6
	.byte	0x73
	.sleb128 0
	.byte	0x71
	.sleb128 0
	.byte	0x1c
	.byte	0x9f
	.4byte	.LVL6
	.4byte	.LFE0
	.2byte	0x1
	.byte	0x54
	.4byte	0
	.4byte	0
.LLST4:
	.4byte	.LVL8
	.4byte	.LVL9
	.2byte	0x1
	.byte	0x50
	.4byte	.LVL9
	.4byte	.LVL11
	.2byte	0x1
	.byte	0x53
	.4byte	.LVL11
	.4byte	.LVL12
	.2byte	0x3
	.byte	0x73
	.sleb128 -4
	.byte	0x9f
	.4byte	.LVL12
	.4byte	.LFE1
	.2byte	0x1
	.byte	0x53
	.4byte	0
	.4byte	0
.LLST5:
	.4byte	.LVL8
	.4byte	.LVL9
	.2byte	0x2
	.byte	0x30
	.byte	0x9f
	.4byte	.LVL9
	.4byte	.LVL10
	.2byte	0x6
	.byte	0x73
	.sleb128 0
	.byte	0x70
	.sleb128 0
	.byte	0x1c
	.byte	0x9f
	.4byte	.LVL10
	.4byte	.LVL11
	.2byte	0x1
	.byte	0x52
	.4byte	.LVL12
	.4byte	.LFE1
	.2byte	0x1
	.byte	0x52
	.4byte	0
	.4byte	0
.LLST6:
	.4byte	.LVL16
	.4byte	.LVL18-1
	.2byte	0x1
	.byte	0x51
	.4byte	.LVL20
	.4byte	.LVL21-1
	.2byte	0x1
	.byte	0x50
	.4byte	0
	.4byte	0
.LLST7:
	.4byte	.LVL17
	.4byte	.LVL18-1
	.2byte	0x2
	.byte	0x74
	.sleb128 -4
	.4byte	.LVL20
	.4byte	.LVL21-1
	.2byte	0x2
	.byte	0x74
	.sleb128 -4
	.4byte	0
	.4byte	0
.LLST8:
	.4byte	.LVL14
	.4byte	.LVL15
	.2byte	0x1
	.byte	0x54
	.4byte	.LVL15
	.4byte	.LVL17
	.2byte	0x3
	.byte	0x74
	.sleb128 4
	.byte	0x9f
	.4byte	.LVL17
	.4byte	.LVL19
	.2byte	0x1
	.byte	0x54
	.4byte	.LVL19
	.4byte	.LVL20
	.2byte	0x3
	.byte	0x74
	.sleb128 4
	.byte	0x9f
	.4byte	.LVL20
	.4byte	.LFE2
	.2byte	0x1
	.byte	0x54
	.4byte	0
	.4byte	0
	.section	.debug_aranges,"",%progbits
	.4byte	0x7c
	.2byte	0x2
	.4byte	.Ldebug_info0
	.byte	0x4
	.byte	0
	.2byte	0
	.2byte	0
	.4byte	.LFB3
	.4byte	.LFE3-.LFB3
	.4byte	.LFB4
	.4byte	.LFE4-.LFB4
	.4byte	.LFB5
	.4byte	.LFE5-.LFB5
	.4byte	.LFB6
	.4byte	.LFE6-.LFB6
	.4byte	.LFB7
	.4byte	.LFE7-.LFB7
	.4byte	.LFB8
	.4byte	.LFE8-.LFB8
	.4byte	.LFB9
	.4byte	.LFE9-.LFB9
	.4byte	.LFB10
	.4byte	.LFE10-.LFB10
	.4byte	.LFB11
	.4byte	.LFE11-.LFB11
	.4byte	.LFB12
	.4byte	.LFE12-.LFB12
	.4byte	.LFB0
	.4byte	.LFE0-.LFB0
	.4byte	.LFB1
	.4byte	.LFE1-.LFB1
	.4byte	.LFB2
	.4byte	.LFE2-.LFB2
	.4byte	0
	.4byte	0
	.section	.debug_ranges,"",%progbits
.Ldebug_ranges0:
	.4byte	.LFB3
	.4byte	.LFE3
	.4byte	.LFB4
	.4byte	.LFE4
	.4byte	.LFB5
	.4byte	.LFE5
	.4byte	.LFB6
	.4byte	.LFE6
	.4byte	.LFB7
	.4byte	.LFE7
	.4byte	.LFB8
	.4byte	.LFE8
	.4byte	.LFB9
	.4byte	.LFE9
	.4byte	.LFB10
	.4byte	.LFE10
	.4byte	.LFB11
	.4byte	.LFE11
	.4byte	.LFB12
	.4byte	.LFE12
	.4byte	.LFB0
	.4byte	.LFE0
	.4byte	.LFB1
	.4byte	.LFE1
	.4byte	.LFB2
	.4byte	.LFE2
	.4byte	0
	.4byte	0
	.section	.debug_macro,"",%progbits
.Ldebug_macro0:
	.2byte	0x4
	.byte	0x2
	.4byte	.Ldebug_line0
	.byte	0x3
	.uleb128 0
	.uleb128 0x1
	.byte	0x5
	.uleb128 0x1
	.4byte	.LASF0
	.byte	0x5
	.uleb128 0x2
	.4byte	.LASF1
	.byte	0x5
	.uleb128 0x3
	.4byte	.LASF2
	.byte	0x5
	.uleb128 0x4
	.4byte	.LASF3
	.byte	0x5
	.uleb128 0x5
	.4byte	.LASF4
	.byte	0x5
	.uleb128 0x6
	.4byte	.LASF5
	.byte	0x5
	.uleb128 0x7
	.4byte	.LASF6
	.byte	0x5
	.uleb128 0x8
	.4byte	.LASF7
	.byte	0x5
	.uleb128 0x9
	.4byte	.LASF8
	.byte	0x5
	.uleb128 0xa
	.4byte	.LASF9
	.byte	0x5
	.uleb128 0xb
	.4byte	.LASF10
	.byte	0x5
	.uleb128 0xc
	.4byte	.LASF11
	.byte	0x5
	.uleb128 0xd
	.4byte	.LASF12
	.byte	0x5
	.uleb128 0xe
	.4byte	.LASF13
	.byte	0x5
	.uleb128 0xf
	.4byte	.LASF14
	.byte	0x5
	.uleb128 0x10
	.4byte	.LASF15
	.byte	0x5
	.uleb128 0x11
	.4byte	.LASF16
	.byte	0x5
	.uleb128 0x12
	.4byte	.LASF17
	.byte	0x5
	.uleb128 0x13
	.4byte	.LASF18
	.byte	0x5
	.uleb128 0x14
	.4byte	.LASF19
	.byte	0x5
	.uleb128 0x15
	.4byte	.LASF20
	.byte	0x5
	.uleb128 0x16
	.4byte	.LASF21
	.byte	0x5
	.uleb128 0x17
	.4byte	.LASF22
	.byte	0x5
	.uleb128 0x18
	.4byte	.LASF23
	.byte	0x5
	.uleb128 0x19
	.4byte	.LASF24
	.byte	0x5
	.uleb128 0x1a
	.4byte	.LASF25
	.byte	0x5
	.uleb128 0x1b
	.4byte	.LASF26
	.byte	0x5
	.uleb128 0x1c
	.4byte	.LASF27
	.byte	0x5
	.uleb128 0x1d
	.4byte	.LASF28
	.byte	0x5
	.uleb128 0x1e
	.4byte	.LASF29
	.byte	0x5
	.uleb128 0x1f
	.4byte	.LASF30
	.byte	0x5
	.uleb128 0x20
	.4byte	.LASF31
	.byte	0x5
	.uleb128 0x21
	.4byte	.LASF32
	.byte	0x5
	.uleb128 0x22
	.4byte	.LASF33
	.byte	0x5
	.uleb128 0x23
	.4byte	.LASF34
	.byte	0x5
	.uleb128 0x24
	.4byte	.LASF35
	.byte	0x5
	.uleb128 0x25
	.4byte	.LASF36
	.byte	0x5
	.uleb128 0x26
	.4byte	.LASF37
	.byte	0x5
	.uleb128 0x27
	.4byte	.LASF38
	.byte	0x5
	.uleb128 0x28
	.4byte	.LASF39
	.byte	0x5
	.uleb128 0x29
	.4byte	.LASF40
	.byte	0x5
	.uleb128 0x2a
	.4byte	.LASF41
	.byte	0x5
	.uleb128 0x2b
	.4byte	.LASF42
	.byte	0x5
	.uleb128 0x2c
	.4byte	.LASF43
	.byte	0x5
	.uleb128 0x2d
	.4byte	.LASF44
	.byte	0x5
	.uleb128 0x2e
	.4byte	.LASF45
	.byte	0x5
	.uleb128 0x2f
	.4byte	.LASF46
	.byte	0x5
	.uleb128 0x30
	.4byte	.LASF47
	.byte	0x5
	.uleb128 0x31
	.4byte	.LASF48
	.byte	0x5
	.uleb128 0x32
	.4byte	.LASF49
	.byte	0x5
	.uleb128 0x33
	.4byte	.LASF50
	.byte	0x5
	.uleb128 0x34
	.4byte	.LASF51
	.byte	0x5
	.uleb128 0x35
	.4byte	.LASF52
	.byte	0x5
	.uleb128 0x36
	.4byte	.LASF53
	.byte	0x5
	.uleb128 0x37
	.4byte	.LASF54
	.byte	0x5
	.uleb128 0x38
	.4byte	.LASF55
	.byte	0x5
	.uleb128 0x39
	.4byte	.LASF56
	.byte	0x5
	.uleb128 0x3a
	.4byte	.LASF57
	.byte	0x5
	.uleb128 0x3b
	.4byte	.LASF58
	.byte	0x5
	.uleb128 0x3c
	.4byte	.LASF59
	.byte	0x5
	.uleb128 0x3d
	.4byte	.LASF60
	.byte	0x5
	.uleb128 0x3e
	.4byte	.LASF61
	.byte	0x5
	.uleb128 0x3f
	.4byte	.LASF62
	.byte	0x5
	.uleb128 0x40
